//
//  MarketDataModel.swift
//  CryptoManager (iOS)
//
//  Created by Вардан Мукучян on 10.04.2022.
//

import Foundation

// JSON data
 /*
  https://api.coingecko.com/api/v3/global

  JSON Responce:
  {
    "data": {
      "active_cryptocurrencies": 13615,
      "upcoming_icos": 0,
      "ongoing_icos": 49,
      "ended_icos": 3376,
      "markets": 788,
      "total_market_cap": {
        "btc": 48705068.43486981,
        "eth": 638693444.7558479,
        "ltc": 18480903437.328213,
        "bch": 6351962593.212113,
        "bnb": 4922810285.282504,
        "eos": 850325660064.7472,
        "xrp": 2734385817986.093,
        "xlm": 10150437944486.51,
        "link": 132690575329.91774,
        "dot": 104620959987.69624,
        "yfi": 101186890.89276384,
        "usd": 2106334546205.5398,
        "aed": 7736566788212.942,
        "ars": 234897137409765.3,
        "aud": 2823488800824.873,
        "bdt": 181810522240030.56,
        "bhd": 794353522072.3093,
        "bmd": 2106334546205.5398,
        "brl": 9898929833347.578,
        "cad": 2647135940943.816,
        "chf": 1960951123157.344,
        "clp": 1716662655157515,
        "cny": 13407030020052.877,
        "czk": 47089531065153.02,
        "dkk": 14320357742633.092,
        "eur": 1925526788759.2598,
        "gbp": 1614644447746.598,
        "hkd": 16510282175304.809,
        "huf": 729778570722012.9,
        "idr": 30269396546428690,
        "ils": 6748360978849.693,
        "inr": 159907652911559.2,
        "jpy": 261430876359119.66,
        "krw": 2589011639141271,
        "kwd": 642377271894.4868,
        "lkr": 664613119013361,
        "mmk": 3906463306973284,
        "mxn": 42247805160517.664,
        "myr": 8891891286806.713,
        "ngn": 875497954130332.1,
        "nok": 18242169416562.273,
        "nzd": 3075113632049.1343,
        "php": 108686856265202.53,
        "pkr": 392357467594437.25,
        "pln": 8927214517146.541,
        "rub": 170297329205489.2,
        "sar": 7899175815180.001,
        "sek": 19901807276550.367,
        "sgd": 2871365785060.1245,
        "thb": 70336941137172.836,
        "try": 31051583880162.11,
        "twd": 60887180826799.58,
        "uah": 61952162530372.055,
        "vef": 210907278111.56116,
        "vnd": 48150807726258670,
        "zar": 30858854269184.273,
        "xdr": 1517508723813.7808,
        "xag": 85004837760.92584,
        "xau": 1081665979.5129313,
        "bits": 48705068434869.81,
        "sats": 4870506843486981
      },
      "total_volume": {
        "btc": 1530483.8161378084,
        "eth": 20069984.748698067,
        "ltc": 580734706.414791,
        "bch": 199600909.35143495,
        "bnb": 154691938.92247036,
        "eos": 26720210093.04375,
        "xrp": 85923978263.1802,
        "xlm": 318962307208.7826,
        "link": 4169602561.3437095,
        "dot": 3287556947.057564,
        "yfi": 3179646.469930911,
        "usd": 66188407858.42272,
        "aed": 243110022063.9865,
        "ars": 7381290670877.295,
        "aud": 88723906024.01927,
        "bdt": 5713123312084.586,
        "bhd": 24961369502.01549,
        "bmd": 66188407858.42272,
        "brl": 311059041571.44415,
        "cad": 83182281576.07286,
        "chf": 61619951571.21876,
        "clp": 53943552404614.52,
        "cny": 421295834859.64636,
        "czk": 1479717974344.0784,
        "dkk": 449995790391.13794,
        "eur": 60506794927.85583,
        "gbp": 50737783058.399734,
        "hkd": 518810885215.42255,
        "huf": 22932198388095.895,
        "idr": 951170443390644,
        "ils": 212057134821.5366,
        "inr": 5024858453591.811,
        "jpy": 8215073670236.318,
        "krw": 81355812461219.61,
        "kwd": 20185743498.214565,
        "lkr": 20884471684975.246,
        "mmk": 122754757600922.69,
        "mxn": 1327573990620.3152,
        "myr": 279414363774.33234,
        "ngn": 27511211726353.387,
        "nok": 573232847432.037,
        "nzd": 96630839415.19434,
        "php": 3415321646929.399,
        "pkr": 12329245673827.703,
        "pln": 280524343374.1169,
        "rub": 5351338467556.5625,
        "sar": 248219767150.65643,
        "sek": 625384481070.7004,
        "sgd": 90228368534.64119,
        "thb": 2210233011601.9355,
        "try": 975749508648.869,
        "twd": 1913288449441.065,
        "uah": 1946753904149.9553,
        "vef": 6627445278.863881,
        "vnd": 1513067003643544.5,
        "zar": 969693269329.8225,
        "xdr": 47685438441.60063,
        "xag": 2671149690.7244787,
        "xau": 33989733.087535836,
        "bits": 1530483816137.8083,
        "sats": 153048381613780.84
      },
      "market_cap_percentage": {
        "btc": 39.027059288760334,
        "eth": 18.844210180463683,
        "usdt": 3.920508539877073,
        "bnb": 3.415468514501358,
        "usdc": 2.4189142505868984,
        "sol": 1.786401831049199,
        "xrp": 1.7603664112809847,
        "ada": 1.6213473991691918,
        "luna": 1.6155298454062803,
        "avax": 1.0789152366022272
      },
      "market_cap_change_percentage_24h_usd": 1.934435891822478,
      "updated_at": 1649619677
    }
  }
  
  */

struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]?
    let marketCapChangePercentage24HUsd: Double?
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap?.first(where: { $0.key == "usd" })
        {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume?.first(where: { $0.key == "usd" })
        {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = totalMarketCap?.first(where: { $0.key == "btc" })
        {
            return item.value.asPercentString()
        }
        return ""
    }
    
}

